BackwardStepIco/Backward-Facing_rhoPimpleCentralFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{

inlet
{
    type            fixedValue;
    value           uniform 300;
}
outlet
{
    type            inletOutlet;
    inletValue      uniform 300;
    value           uniform 300;
}
walls
{
    type            zeroGradient;
}

    symwall
    {
        type            empty;
    }
}


// ************************************************************************* //
