BackwardStepIco/Backward-Facing_rhoPimpleCentralFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (44.2 0 0);

boundaryField
{

inlet
{
    type            fixedValue;
    value           uniform (44.2 0 0);   // M = 2, T = 167 К, p = 35 кПа
}
outlet
{
    type            pressureInletOutletVelocity;
    value           uniform (44.2 0 0);
}
    walls
    {
        type            noSlip;
    }
    symwall
    {
        type            empty;
    }
}

// ************************************************************************* //
