BackwardStepIco/Backward-Facing_rhoPimpleCentralFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          306;
        startFace       1208733;
    }
    outlet
    {
        type            patch;
        nFaces          387;
        startFace       1209039;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7761;
        startFace       1209426;
    }
    symwall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          303240;
        startFace       1217187;
    }
)

// ************************************************************************* //
